tsung/zebra-small.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
	<clients>
  		<client host="localhost" use_controller_vm="true" />
	</clients>

	<servers>
	  <server host="localhost" port="3000" type="tcp"></server>
	</servers>


	<load duration="30" unit="second">
	  <arrivalphase phase="1" duration="30" unit="second">
	    <users maxnumber="1000" interarrival="0.1" unit="second"></users>
	  </arrivalphase>
	</load>


	<sessions>
		<session name="http-example" probability="100" type="ts_http">
				<setdynvars sourcetype="value" value="mspray">
				  	<var name="username" />
				</setdynvars>
				<setdynvars sourcetype="value" value="1234">
				  	<var name="password" />
				</setdynvars>
				<setdynvars sourcetype="value" value="177">
				  	<var name="project" />
				</setdynvars>
				<setdynvars sourcetype="random_string" length="8">
					<var name="name" />
				</setdynvars>

				<transaction name="projectsendpoint">
					<request subst="true">
					   	<http url="/login" method="GET" version="1.1">
					   		<www_authenticate userid="royrutto" passwd="Kiprono48411!"/-->
						</http>
					</request>
				</transaction>

		 </session>
	</sessions>
</tsung>